{
  "basics": {
    "name": "Mohammad Alam Jamal",
    "label": "Fullstack Developer",
    "image": "https://i.ibb.co/mcHwnqz/1692293739418.jpg",
    "email": "alamjamal88@hotmail.com",
    "phone": "7416815171",
    "url": "https://linkedin.com/in/alamjamal",
    "summary": "Full-Stack Developer skilled in ReactJS, Material-UI, and Node.js. Experienced in monolithic and serverless architectures with AWS Lambda. Proficient in Nginx reverse proxy, DevOps pipelines, and multimedia content handling. Expertise in API integration, AWS S3, and scalable solutions, ensuring high performance, seamless deployment, and user-focused application development.",
    "location": {
      "address": "Tolichawki",
      "postalCode": "500008",
      "city": "Hyderabad",
      "countryCode": "IN",
      "region": "Telangana"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "alamjamal",
        "url": "https://linkedin.com/in/alamjamal"
      },
      {
        "network": "GitHub",
        "username": "alamjamal",
        "url": "https://github.com/alamjamal"
      }
    ]
  },
  "work": [
    {
      "name": "Instrive SoftLabs",
      "position": "Software Engineer",
      "url": "",
      "startDate": "2023-01",
      "endDate": "",
      "summary": "Implemented a robust and user-friendly web application using React, Redux for state management, MaterialUI(MUI) for the UI components",
      "highlights": [
        "Implemented serverless architecture using AWS Lambda and Serverless-http and cut the cost over 50%.",
        "Implemented authentication and authorization using JWT RS256 Asymmetric Algorithm.",
        "Employed advanced logging techniques by integrating Morgan, Winston and Sentry with a rotate file stream, facilitating effective debugging and system monitoring.",
        "Introduced a centralized error handling mechanism, enhancing application stability",
        "Engineered a robust chunk video stream and upload service, enabling efficient handling and delivery of large multimedia content.",
        "Created an asynchronous Cron job for daily database backups, safeguarding data integrity and providing a fail-safe mechanism against potential data loss.",
        "Leveraged Redis and a rate limiter mechanism to implement caching and protect against excessive requests, optimizing performance and enhancing security.",
        "Successfully managed a dedicated server, overseeing the complete CI/CD pipeline for a MERN stack application, with docker ensuring smooth deployment and continuous integration practices.",
        "Configured Nginx reverse proxy to efficiently route incoming traffic and optimize application performance.",
        "Conducted code reviews and provided technical guidance to junior developers."
      ]
    },
    {
      "name": "MANUU",
      "position": "Backend Developer",
      "url": "",
      "startDate": "2021-04",
      "endDate": "2023-01",
      "summary": "Worked on Project Sponsored By Ministry of Electronics and Information Technology LMS for intellectually disabled Children.",
      "highlights": [
        "Implemented robust Event Driven Micro-services architecture using Nodejs and RabbitMQ enabling seamless scaling and efficient resource utilization.",
        "Integrated Formik with Yup validation for form handling, showcasing expertise in modern front-end development.",
        "Orchestrated the creation of responsive user interfaces by leveraging React.js and Material-UI, resulting in enhanced user engagement and satisfaction.",
        "Seamlessly integrated frontend and backend systems through RESTful APIs, ensuring smooth data flow and a cohesive user experience.",
        "Leveraged the power of AWS S3 for efficient storage and delivery of static assets.",
        "Demonstrated expertise in advanced production process management and clustering by effectively utilizing PM2, ensuring optimal resource utilization and high availability.",
        "Pioneered dynamic text generation in the backend by harnessing the capabilities of the ChatGPT API, enhancing content personalization and interactivity.",
        "Led the seamless deployment of code updates through an integrated pipeline, effectively managing continuous deployment using GitHub Actions."
      ]
    },
    {
      "name": "Vengai Software Solutions",
      "position": "Associate Software Engineer",
      "url": "",
      "startDate": "2019-08",
      "endDate": "2021-03",
      "summary": "Developed and maintained React.js applications, consistently delivering high-quality code and features.",
      "highlights": [
        "Collaborated with the Software Architect to understand and adhere to coding standards and architectural practices.",
        "Utilized Redux for state management, ensuring efficient data flow and maintainable codebase.",
        "Worked in an Agile/Scrum environment, participating in daily stand-ups, sprint planning, and retrospectives.",
        "Collaborated with cross-functional teams including backend developers, designers, and QA engineers."
      ]
    }
  ],
  "projects": [
    {
      "name": "InstaXerox.in",
      "description": "InstaXerox offers a seamless platform for printing, copying, and scanning documents with just a few clicks. ",
      "highlights": [
        "Users can upload files online, select specifications, and place orders instantly.",
        "Equipped with real-time order tracking to keep users updated on their order status.",
        "Ensures high-quality printing, copying, and scanning for personal and professional needs.",
        "Features a user-friendly interface and secure payment options for a hassle-free experience.",
        "Caters to individuals, businesses, and educational institutions with timely delivery and excellent service."
      ],
      "keywords": ["React", "Nodejs", "ExpressJs", "AWS", "MongoDB"],
      "startDate": "2024-12",
      "endDate": "Working",
      "roles": ["Developer"],
      "entity": "",
      "type": "application"
    }
  ],
  "education": [
    {
      "institution": "MANUU, Central University Hyderabad",
      "url": "",
      "area": "Computer Science Engineering",
      "studyType": "B.Tech",
      "startDate": "2013",
      "endDate": "2017",
      "score": ""
    },
    {
      "institution": "MANUU, Central University Hyderabad",
      "url": "",
      "area": "Computer Science Engineering",
      "studyType": "M.Tech",
      "startDate": "2017",
      "endDate": "2019",
      "score": ""
    }
  ],

  "awards": [
    {
      "title": "Gold Medalist",
      "date": "2019",
      "awarder": "MANUU, Central University Hyderabad",
      "summary": "Awarded for outstanding academic performance in M.Tech (CSE)."
    }
  ],

  "certificates": [
    {
      "name": "Python for Data Science Expert",
      "date": "2019-04",
      "issuer": "Edureka",
      "url": "https://www.edureka.co/my-certificate/83c7b4dc2ce54cd7b6aadf21f9287c23"
    }
  ],
  "publications": [
    {
      "name": "CDPS-IoT: Cardiovascular Disease Prediction System Based on IoT using Machine Learning",
      "publisher": "INTERNATIONAL JOURNAL OF INTERACTIVE MULTIMEDIA AND ARTIFICIAL INTELLIGENCE",
      "releaseDate": "2022-02",
      "url": "https://reunir.unir.net/handle/123456789/13565",
      "summary": "In this research, we utilized cutting-edge machine learning and IoT infrastructure to forecast cardiovascular diseases. Patient data is gathered via NodeMCU and IoT sensors, transmitted to the ThingSpeak Cloud. Following this, our machine learning application analyzes the data to determine the likelihood of a patient having cardiovascular disease."
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "",
      "keywords": ["JavaScript", "Nodejs", "Python", "MongoDB", "MySql"]
    },
    {
      "name": "Development Environment",
      "level": "",
      "keywords": ["AWS", "Linux"]
    },
    {
      "name": "Technologies/Frameworks",
      "level": "",
      "keywords": ["ExpressJs", "ReactJs", "Redux"]
    }
  ],
  "languages": [],
  "interests": [],
  "references": []
}
